Switch>enable
Switch#configure terminal 
Enter configuration commands, one per line. End with CNTL/Z.
Switch(config)#hostname Sw1
Sw1(config)#enable secret eve
Sw1(config)#line console 0
Sw1(config-line)#password eve
Sw1(config-line)#login
Sw1(config-line)#logging synchronous 
Sw1(config-line)#exit
Sw1(config)#line vty 0 15
Sw1(config-line)#password eve
Sw1(config-line)#login
Sw1(config-line)#transport input ssh
Sw1(config-line)#exit
Sw1(config)#service password-encryption 
Sw1(config)#vlan 10
Sw1(config-vlan)#name DatiAmministrativi
Sw1(config-vlan)#exit
Sw1(config)#interface fastEthernet 0/2
Sw1(config-if)#switchport mode access 
Sw1(config-if)#switchport access vlan 10
Sw1(config-if)#exit
Sw1(config)#interface fastEthernet 0/1
Sw1(config-if)#switchport mode access 
Sw1(config-if)#switchport access vlan 10
Sw1(config)#ip domain-name mydomain.com
Sw1(config)#crypto key generate rsa
The name for the keys will be: Sw1.mydomain.com
Choose the size of the key modulus in the range of 360 to 4096 for your
  General Purpose Keys. Choosing a key modulus greater than 512 may take
  a few minutes.

How many bits in the modulus [512]: 
%CDP-4-NATIVE_VLAN_MISMATCH: Native VLAN mismatch discovered on FastEthernet0/2 (10), with Sw2 FastEthernet0/2 (20).

The name for the keys will be: Sw1.mydomain.com
Choose the size of the key modulus in the range of 360 to 4096 for your
  General Purpose Keys. Choosing a key modulus greater than 512 may take
  a few minutes.

How many bits in the modulus [512]: 1024
% Generating 1024 bit RSA keys, keys will be non-exportable...[OK]

----------------------------------------------------------------------------------------

Switch>enable
Switch#configure terminal 
Enter configuration commands, one per line. End with CNTL/Z.
Switch(config)#hostname Sw2
Sw2(config)#enable secret eve
Sw2(config)#line console 0
Sw2(config-line)#password eve
Sw2(config-line)#login
Sw2(config-line)#logging synchronous
Sw2(config-line)#exit
Sw2(config)#line vty 0 15
Sw2(config-line)#password eve
Sw2(config-line)#login
Sw2(config-line)#transport input ssh
Sw2(config-line)#exit
Sw2(config)#service password-encryption 
%CDP-4-NATIVE_VLAN_MISMATCH: Native VLAN mismatch discovered on FastEthernet0/2 (1), with Sw1 FastEthernet0/2 (10).
Sw2(config)#vlan 20
Sw2(config-vlan)#name DatiFormali
Sw2(config-vlan)#exit
Sw2(config)#interface fastEthernet 0/2
%CDP-4-NATIVE_VLAN_MISMATCH: Native VLAN mismatch discovered on FastEthernet0/2 (1), with Sw1 FastEthernet0/2 (10).
Sw2(config-if)#switchport mode access
Sw2(config-if)#switchport access vlan 20
Sw2(config-if)#exit
Sw2(config)#interface fastEthernet 0/1
Sw2(config-if)#switchport mode access
Sw2(config-if)#switchport access vlan 20
Sw1(config)#ip domain-name mydomain2.com
Sw1(config)#crypto key generate rsa
The name for the keys will be: Sw2.mydomain2.com
Choose the size of the key modulus in the range of 360 to 4096 for your
  General Purpose Keys. Choosing a key modulus greater than 512 may take
  a few minutes.

How many bits in the modulus [512]: 
%CDP-4-NATIVE_VLAN_MISMATCH: Native VLAN mismatch discovered on FastEthernet0/2 (10), with Sw2 FastEthernet0/2 (20).

The name for the keys will be: Sw1.mydomain.com
Choose the size of the key modulus in the range of 360 to 4096 for your
  General Purpose Keys. Choosing a key modulus greater than 512 may take
  a few minutes.

How many bits in the modulus [512]: 1024
% Generating 1024 bit RSA keys, keys will be non-exportable...[OK]
